// оператор розгалуження if
// if (1 == 1){
//     console.log("Код виконається")
// }

// оператор розгалуження if else
// if (1 === 1){
//     console.log("Код виконається")
// } else {
//     console.log("Повторіть спробу")
// }

// оператор розгалуження else if
// const userAge = prompt("Ведіть ваш вік")
// console.log(userAge)

// if (userAge >= 1 && userAge < 13){
//     alert("Ти дитина")
// } else if (userAge >= 13 && userAge < 18){
//     alert("Ти підліток")
// } else if (userAge >= 18 && userAge < 60){
//     alert("Ти дорослий")
// } else if (userAge >= 60 && userAge < 130){
//     alert("Ти старий")
// } else {
//     alert("НЕБРЕШІТЬ ВЕДІТЬ СВІЙ РЕАЛЬНИЙ ВІК")
// }

// const goSchool = confirm("Ти ходиш до школи")
// console.log(goSchool)

// if (goSchool){
//     alert("Молодець що навчаєшся")
// } else {
//     alert("Ти не малий щоб не ходити до школи і не тупий щоб не ходити")
// }

// Тернарний оператор

// Умова ? те що виконається при true : те що виконається при false

// confirm("Ти ходиш до школи") ? alert("Молодець що навчаєшся") : alert("Ти не малий щоб не ходити до школи і не тупий щоб не ходити")

//--------------------------------------------

// Напиши скрипт обробки покупки в магазині. 
//   - Баланс користувача зберігається в змінній balance - отримати з інпуту
//   - Сумма покупки зберігається в змінній payment - отримати з інпуту
//   - Перед перевіркою вивести повідомлення на екран:
//   «Загальна вартість замовлення [число] кредитів. Перевіряємо кількість 
//   доступних коштів на рахунку»
//  - Якщо сума покупки не перевищує баланс:
//      - Відняти з балансу суму покупки
//    - Вивести повідомлення «На рахунку залишилося [число] кредитів»
// - Якщо сума покупки перевищує баланс:
//     - Вивести повідомлення «На рахунку недостатньо коштів для проведення операції!»
//  - В кінці вивести повідомлення «Операція завершена»

// let balance = Number(prompt("Ведіть суму коштів на рахунку"));
// console.log(balance)

// let payment = Number(prompt("Ведіть ціну за яку ви хочете купити телефон"));

// alert(`Загальна вартість замовлення ${payment} кредитів. Перевіряємо кількість доступних коштів на рахунку`)

// if (payment < balance){
//     balance -= payment
//     alert(`дякую за покупку. На рахунку залишилося ${balance} кредитів`)
// } else{
//     alert("На рахунку недостатньо коштів для проведення операції!")
// }
// alert("Операція завершена")
// console.log(balance)

//-------------------------

// Напиши скрит підрахунку суми покупки зі знижкою в залежності від витраченої суми за весь час (партнерська програма).
// Користувач вводить в інпут сумму витрачену в даному магазині і отримує розмір знижки як результат.
//  - Загальна сума витрачених коштів зберігається в змінній totalSpent
//  - Сума поточного платежа зберігається в змінній payment
//  - Знижка зберігається в змінній discount
// - Якщо витрачено від [100 до 1000) - бронзовий партнер, знижка 2%
//  - Якщо витрачено від [1000 до 5000) - срібний партнер, знижка 5%
//  - Якщо витрачено більше [5000 - золотий партнер, знижка 10%
//  - Якщо витрачено менше 100) - не партнер, знижка 0%

//  - В результаті вивести повідомлення
//  «Оформляемо замовлення на суму [сума] зі знижкою [знижка]%»

// 'Бронзовий партнер, знижка 2%'
// 'Срібний партнер, знижка 5%'
// 'Золотий партнер, знижка 10%'
// 'У вас ще немає партнерської знижки'

// let totalSpent = Number(prompt("Ведіть суму коштів на рахунку"));

// let payment = Number(prompt("Сума поточного плдатежа"));

// let discountBronz = payment / 100 * 98
// let discountSilver = payment / 100 * 95
// let discountGold = payment / 100 * 90

// if (payment >= 100 && payment < 1000){
//     alert(`Оформляемо замовлення на суму ${payment} зі знижкою 2%`)
//     totalSpent = totalSpent - discountBronz
// } else if (payment >= 1000 && payment < 5000){
//     alert(`Оформляемо замовлення на суму ${payment} зі знижкою 5%`)
//     totalSpent = totalSpent - discountSilver
// } else if (payment >= 5000){
//     alert(`Оформляемо замовлення на суму ${payment} зі знижкою 10%`)
//     totalSpent = totalSpent - discountGold
// } else{
//     alert(`Оформляемо замовлення на суму ${payment} і У вас ще немає партнерської знижки`)
// }
// alert(`У вас на балансі ${totalSpent} гривень`)

//----------------------------

// let hotelStars = Number(prompt("Ведіть на скільки зірок ви хочете готель"))
// console.log(hotelStars)

// if (hotelStars === 1 ) {
//     alert("Кімната в цьому готелі буде коштувати 20$")
// } else if (hotelStars === 2 ) {
//     alert("Кімната в цьому готелі буде коштувати 30$")
// } else if (hotelStars === 3 ) {
//     alert("Кімната в цьому готелі буде коштувати 50$")
// } else if (hotelStars === 4 ) {
//     alert("Кімната в цьому готелі буде коштувати 70$")
// } else if (hotelStars === 5 ) {
//     alert("Кімната в цьому готелі буде коштувати 120$")
// } else {
//     alert("Такої кількості зірок нема")
// } 

// switch ("змінна що порівнює") {
//     case значення з яким порівнюємо:
//     інструкція яку треба виконати якщо case-true;

//     break;
//     case значення з яким порівнюємо;
//     інструкція яку треба виконати якщо case-true;

//     default:
//     інструкція
// }

// switch (hotelStars) {
//     case 1 :
//     alert("Кімната в цьому готелі буде коштувати 20$");

//     break;
//     case 2 :
//     alert("Кімната в цьому готелі буде коштувати 30$");

//     break;
//     case 3 :
//     alert("Кімната в цьому готелі буде коштувати 50$");

//     break;
//     case 4 :
//     alert("Кімната в цьому готелі буде коштувати 70$");

//     break;
//     case 5 :
//     alert("Кімната в цьому готелі буде коштувати 120$");
    
//     break;
//     default:
//     alert("Такої кількості зірок нема")
// }

// if(browser == 'Edge') {
//     alert("You've got the Edge!");
//   } else if (browser == 'Chrome'
//    || browser == 'Firefox'
//    || browser == 'Safari'
//    || browser == 'Opera') {
//     alert('Ми підтримуємо і ці браузери' );
//   } else {
//     alert('Маємо надію, що ця сторінка виглядає добре!' );
//   }

// let browser = prompt("Ведіть свій бровзер")

// switch (browser) {
//     case "Edge" :
//     alert("You've got the Edge!");

//     break;
//     case "Chrome" :
//     alert("Ми підтримуємо і ці браузери" );

//     break;
//     case "Firefox" :
//     alert("Ми підтримуємо і ці браузери" );

//     break;
//     case "Safari" :
//     alert("Ми підтримуємо і ці браузери" );

//     break;
//     case "Opera" :
//     alert("Ми підтримуємо і ці браузери" );    

//     break;
//     default:
//     alert("Маємо надію, що ця сторінка виглядає добре!");
//   }

//   switch (browser) {
//     case "Edge" :
//     alert("You've got the Edge!");

//     case "Chrome" :
//     case "Firefox" :
//     case "Safari" :
//     case "Opera" :  
//     alert("Ми підтримуємо і ці браузери" );   

//     break;
//     default:
//     alert("Маємо надію, що ця сторінка виглядає добре!");
//   }



// Змінна lang може приймати 4 значення: 'ua', 'en', 'de', 'fr'.
//  За допомогою конструкції switch
//  виведи на екран назву місяця в залежності від обраної мови.
//  Наприклад, якщо lang = 'fr', то в консоль виводимо "Janvier".
// let lang = prompt("Ведіть мову")

// switch (lang) {
//     case "ua" :
//     case "en" :
//     case "de" :
//     case "fr" :  
//     alert(`Thank you for chose ${lang}`);   

//     break;
//     default:
//     alert("Sorry but we dont support this language");
// }




// Напиши скрипт вибору опції доставки товару.
//  Опція зберігається в змінній option:
//   1 - самовивіз, 2 - кур'єр, 3 - пошта.
//    В змінну message записати повідомлення в залежності від опції.
//  - 'Ви зможете забрати товар завтра з 12:00 в нашому офісі'
//  - 'Кур"єр доставить замовлення завтра з 9:00 до 18:00'
//     - 'Посилка буде відправлена сьогодні'
//      - 'Вам передзвонить менеджер'.

// let option = Number(prompt("Ведіть тип отримання посилки. 1 - самовивіз, 2 - кур'єр, 3 - пошта"))

// switch (option) {
//     case 1 :
//     alert("Ви зможете забрати товар завтра з 12:00 в нашому офісі");

//     break;
//     case 2 :
//     alert("Курєр доставить замовлення завтра з 9:00 до 18:00");

//     break;
//     case 3 :
//     alert("Посилка буде відправлена сьогодні");
// }
//     alert("Вам передзвонить менеджер");