// for (initilization; condition; post-expression) {
//     // statements
// }

// const max = 10

// for (let i = 0; i < max ; i += 1) {

//     console.log(i)

// }

//----------------------------

// // цикл for з лічильником

// for (let i = 0; i < 5; i += 1) {
// console.log(`Це число ${i}`)
// }

// // крок 1
// // запускаємо йього і ініціалізуємо йього через let i = 0
// // крок 2
// // вказуємо доки має тривати цикл в умові i < 5 та перквіряємо її на true
// // На даному етапі i < 5 тому буде true
// // крок 3
// // оскільки в умові true, то виконується тіло циклу у фігурних дужках console.log(`Це число ${0}`)
// // крок 4
// // збільшуємо ітерацію i += 1 тобто 1 = 0 + 1 тобто вийде i = 1
// // крок 5
// // тепер в i лежить 1 і ми перівіряємо умову на другому колі i < 5 тобто 1 < 5 це буде true
// // крок 6
// // оскільки в умові true, то виконується тіло циклу у фігурних дужках console.log(`Це число ${1}`)
// // крок 7
// // збільшуємо ітерацію i += 1 тобто 2 = 1 + 1 тобто вийде i = 2
// // крок 8
// // тепер в i лежить 2 і ми перівіряємо умову на третьому колі i < 5 тобто 2 < 5 це буде true
// // крок 9
// // оскільки в умові true, то виконується тіло циклу у фігурних дужках console.log(`Це число ${2}`)
// // крок 10
// // збільшуємо ітерацію i += 1 тобто 3 = 2 + 1 тобто вийде i = 3
// // крок 11
// // тепер в i лежить 3 і ми перівіряємо умову на четвертому колі i < 5 тобто 3 < 5 це буде true
// // крок 12
// // оскільки в умові true, то виконується тіло циклу у фігурних дужках console.log(`Це число ${3}`)
// // крок 13
// // збільшуємо ітерацію i += 1 тобто 4 = 3 + 1 тобто вийде i = 4
// // крок 14
// // тепер в i лежить 4 і ми перівіряємо умову на п'ятому колі i < 5 тобто 4 < 5 це буде true
// // крок 9
// // оскільки в умові true, то виконується тіло циклу у фігурних дужках console.log(`Це число ${4}`)
// // крок 10
// // збільшуємо ітерацію i += 1 тобто 4 = 4 + 1 тобто вийде i = 5
// // крок 11
// // тепер в i лежить 3 і ми перівіряємо умову на шостому колі i < 5 тобто 3 < 5 це буде false
// буде зациклення
// let year = prompt("How old are you");
// while (year > 18){
// alert("U older from me")
// }

// цикл while
// let year = prompt("How old are you");
// while (year < 18){
//     alert(`U ${year} old`)
// year ++
// }

// цикл do while
// let savePas = 631936
// let pasword ;
// do {
// pasword = Number(prompt("pls pasword"))
// } while (pasword !== savePas)

// оператор break перериває цикла там де ми йього поставили і виходить з циклу
// знайти число 33 серед 100
// for (let i = 1; i <= 100; i += 1){
//     console.log(i)
//     if (i === 33){
//         console.log("we found 33")
//         break
//     }
// }

// оператор continue - пропускає вказану ітерацію в циклі
// переберемо числа від одного до ста та переберем лише не парні числа
// for (let i = 1; i <= 100; i += 1){
//     if (i % 2 !== 0){
//     continue;
//     }
//     console.log(i)
// }

// for (let i = 0; i <= 100; i += 2){
//     console.log(i)
// }